xsession/openocd/tcl/packs/Microchip/dsPIC33F-GP-MC_DFP/1.4.235/edc/DSPIC33FJ32GP101.PIC
<?xml version='1.0' encoding='UTF-8' standalone='no'?>
<edc:PIC xmlns:edc="http://crownking/edc" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" edc:arch="33xxxx" edc:desc="" edc:dosid="01624" edc:dsid="80000548" edc:informedby="DOS" edc:isextended="false" edc:masksetid="UEAH" edc:name="DSPIC33FJ32GP101" edc:procid="0x022E" edc:psid="70000659" xsi:schemaLocation="http://crownking/edc edc/PIC.xsd">
  <edc:Properties>
    <edc:Property edc:propkey="file.registers.are.odd.address.accessible" edc:propvalue="true"/>
  </edc:Properties>
  <edc:Import/>
  <edc:Power>
    <edc:VPP edc:defaultvoltage="3.250" edc:maxvoltage="3.500" edc:minvoltage="3.000"/>
    <edc:VDD edc:maxdefaultvoltage="3.500" edc:maxvoltage="3.500" edc:mindefaultvoltage="3.000" edc:minvoltage="3.000" edc:nominalvoltage="3.250"/>
  </edc:Power>
  <edc:Programming edc:haslvp2="true" edc:memtech="ee" edc:tries="1">
    <edc:ProgrammingWaitTime edc:progop="erase" edc:time="600" edc:timeunits="us"/>
    <edc:ProgrammingWaitTime edc:progop="pgm" edc:time="1000" edc:timeunits="us"/>
    <edc:ProgrammingWaitTime edc:progop="cfg" edc:time="10000" edc:timeunits="us"/>
    <edc:ProgrammingRowSize edc:nzsize="512" edc:progop="rowerase" edc:sizeunits="words"/>
    <edc:ProgrammingRowSize edc:nzsize="1" edc:progop="pgm" edc:sizeunits="words"/>
    <edc:ProgrammingRowSize edc:nzsize="2" edc:progop="cfg"/>
    <edc:Wait edc:erase="600" edc:pgm="1000" edc:cfg="10000"/>
    <edc:Latches edc:rowerase="512" edc:pgm="1" edc:cfg="2"/>
  </edc:Programming>
  <edc:ArchDef edc:desc="33xxxx" edc:name="33xxxx">
    <edc:MemTraits>
      <edc:CodeMemTraits edc:locsize="0x2" edc:wordimpl="0xffffff" edc:wordinit="0xffffff" edc:wordsafe="0xffffff" edc:wordsize="0x4"/>
      <edc:ExtCodeMemTraits edc:locsize="0x2" edc:wordimpl="0xffffff" edc:wordinit="0xffffff" edc:wordsafe="0xffffff" edc:wordsize="0x4"/>
      <edc:BackgroundDebugMemTraits edc:locsize="0x2" edc:wordimpl="0xffffff" edc:wordinit="0xffffff" edc:wordsafe="0xff7fff" edc:wordsize="0x4"/>
      <edc:TestMemTraits edc:locsize="0x2" edc:wordimpl="0xffffff" edc:wordinit="0xffffff" edc:wordsafe="0xffffff" edc:wordsize="0x4"/>
      <edc:UserIDMemTraits edc:locsize="0x2" edc:wordimpl="0xffffff" edc:wordinit="0xffffff" edc:wordsafe="0xffffff" edc:wordsize="0x4"/>
      <edc:ConfigFuseMemTraits edc:addrinc="0x2" edc:locsize="0x2" edc:wordimpl="0xffff" edc:wordinit="0xffff" edc:wordsafe="0xffff" edc:wordsize="0x2"/>
      <edc:DeviceIDMemTraits edc:locsize="0x2" edc:wordimpl="0xffff" edc:wordinit="0xffff" edc:wordsafe="0xffff" edc:wordsize="0x2"/>
      <edc:EEDataMemTraits edc:magicoffset="0x0"/>
      <edc:DataMemTraits edc:addrinc="0x2" edc:locsize="0x2" edc:wordimpl="0xffff" edc:wordinit="0x0" edc:wordsafe="0xffff" edc:wordsize="0x2"/>
    </edc:MemTraits>
  </edc:ArchDef>
  <edc:InstructionSet edc:instructionsetid="dspicv2"/>
  <edc:WatchdogTimer edc:min="1"/>
  <edc:InterruptList>
    <edc:Trap edc:cname="ReservedTrap0" edc:desc="Reserved"/>
    <edc:Trap edc:cname="OscillatorFail" edc:desc="Oscillator Fail Trap vector"/>
    <edc:Trap edc:cname="AddressError" edc:desc="Address error Trap vector"/>
    <edc:Trap edc:cname="StackError" edc:desc="Stack Error Trap vector"/>
    <edc:Trap edc:cname="MathError" edc:desc="Math Error Trap vector"/>
    <edc:Trap edc:cname="ReservedTrap5" edc:desc="Reserved"/>
    <edc:Trap edc:cname="ReservedTrap6" edc:desc="Reserved"/>
    <edc:Trap edc:cname="ReservedTrap7" edc:desc="Resereved"/>
    <edc:Interrupt edc:cname="INT0Interrupt" edc:desc="INT0 - External Interrupt 0" edc:irq="0"/>
    <edc:Interrupt edc:cname="IC1Interrupt" edc:desc="IC1 - Input Compare 1" edc:irq="1"/>
    <edc:Interrupt edc:cname="OC1Interrupt" edc:desc="OC1 - Output Compare 1" edc:irq="2"/>
    <edc:Interrupt edc:cname="T1Interrupt" edc:desc="T1 - Timer1" edc:irq="3"/>
    <edc:Interrupt edc:cname="IC2Interrupt" edc:desc="IC2 - Input Capture 2" edc:irq="5"/>
    <edc:Interrupt edc:cname="OC2Interrupt" edc:desc="OC2 - Output Compare 2" edc:irq="6"/>
    <edc:Interrupt edc:cname="T2Interrupt" edc:desc="T2 - Timer2" edc:irq="7"/>
    <edc:Interrupt edc:cname="T3Interrupt" edc:desc="T3 - Timer3" edc:irq="8"/>
    <edc:Interrupt edc:cname="SPI1ErrInterrupt" edc:desc="SPI1E - SPI1 Error" edc:irq="9"/>
    <edc:Interrupt edc:cname="SPI1Interrupt" edc:desc="SPI1 - SPI1 Transfer Done" edc:irq="10"/>
    <edc:Interrupt edc:cname="U1RXInterrupt" edc:desc="U1RX - UART1 Receiver" edc:irq="11"/>
    <edc:Interrupt edc:cname="U1TXInterrupt" edc:desc="U1TX - UART1 Transmitter" edc:irq="12"/>
    <edc:Interrupt edc:cname="ADC1Interrupt" edc:desc="ADC1 - A/D Converter 1" edc:irq="13"/>
    <edc:Interrupt edc:cname="SI2C1Interrupt" edc:desc="SI2C1 - I2C1 Slave Events" edc:irq="16"/>
    <edc:Interrupt edc:cname="MI2C1Interrupt" edc:desc="MI2C1 - I2C1 Master Events" edc:irq="17"/>
    <edc:Interrupt edc:cname="CompInterrupt" edc:desc="Analog Comparator Interrupt" edc:irq="18"/>
    <edc:Interrupt edc:cname="CNInterrupt" edc:desc="Change Notification Interrupt" edc:irq="19"/>
    <edc:Interrupt edc:cname="INT1Interrupt" edc:desc="INT1 - External Interrupt 1" edc:irq="20"/>
    <edc:Interrupt edc:cname="T4Interrupt" edc:desc="T4 - Timer4" edc:irq="27"/>
    <edc:Interrupt edc:cname="T5Interrupt" edc:desc="T5 - Timer5" edc:irq="28"/>
    <edc:Interrupt edc:cname="INT2Interrupt" edc:desc="INT2 - External Interrupt 2" edc:irq="29"/>
    <edc:Interrupt edc:cname="IC3Interrupt" edc:desc="Input Capture 3" edc:irq="37"/>
    <edc:Interrupt edc:cname="RTCCInterrupt" edc:desc="RTCC - Real-Time Clock and Calendar" edc:irq="62"/>
    <edc:Interrupt edc:cname="U1ErrInterrupt" edc:desc="U1E - UART1 Error" edc:irq="65"/>
    <edc:Interrupt edc:cname="CTMUInterrupt" edc:desc="CTMU - Interrupt" edc:irq="77"/>
  </edc:InterruptList>
  <edc:Breakpoints edc:hasdatacapture="true" edc:hwbpcount="0x3" edc:idbyte="r"/>
  <edc:ProgramSpace>
    <edc:ResetSector edc:beginaddr="0x0" edc:endaddr="0x4" edc:regionid="reset"/>
    <edc:VectorSector edc:beginaddr="0x04" edc:endaddr="0x100" edc:regionid="ivt"/>
    <edc:CodeSector edc:beginaddr="0x100" edc:endaddr="0x104" edc:isreserved="true" edc:regionid="_reserved"/>
    <edc:AltVectorSector edc:beginaddr="0x104" edc:endaddr="0x200" edc:regionid="aivt"/>
    <edc:CodeSector edc:beginaddr="0x200" edc:endaddr="0x57fc" edc:regionid="program"/>
    <edc:WORMHoleSector edc:beginaddr="0x57fc" edc:endaddr="0x5800" edc:regionid="cfgmem">
      <edc:WORMHole edc:dstaddr="0xf80004" edc:dstmask="0x1" edc:srcaddr="0x57fe" edc:srcmask="0x1000"/>
      <edc:WORMHole edc:dstaddr="0xf80004" edc:dstmask="0x2" edc:srcaddr="0x57fe" edc:srcmask="0x2000"/>
      <edc:WORMHole edc:dstaddr="0xf80006" edc:dstmask="0x7" edc:srcaddr="0x57fc" edc:srcmask="0x700"/>
      <edc:WORMHole edc:dstaddr="0xf80006" edc:dstmask="0x18" edc:srcaddr="0x57fc" edc:srcmask="0x1800"/>
      <edc:WORMHole edc:dstaddr="0xf80006" edc:dstmask="0x40" edc:srcaddr="0x57fc" edc:srcmask="0x4000"/>
      <edc:WORMHole edc:dstaddr="0xf80006" edc:dstmask="0x80" edc:srcaddr="0x57fc" edc:srcmask="0x8000"/>
      <edc:WORMHole edc:dstaddr="0xf80008" edc:dstmask="0x3" edc:srcaddr="0x57fc" edc:srcmask="0x3"/>
      <edc:WORMHole edc:dstaddr="0xf80008" edc:dstmask="0x20" edc:srcaddr="0x57fc" edc:srcmask="0x10"/>
      <edc:WORMHole edc:dstaddr="0xf80008" edc:dstmask="0x4" edc:srcaddr="0x57fc" edc:srcmask="0x20"/>
      <edc:WORMHole edc:dstaddr="0xf80008" edc:dstmask="0xc0" edc:srcaddr="0x57fc" edc:srcmask="0xc0"/>
      <edc:WORMHole edc:dstaddr="0xf8000a" edc:dstmask="0xf" edc:srcaddr="0x57fe" edc:srcmask="0xf"/>
      <edc:WORMHole edc:dstaddr="0xf8000a" edc:dstmask="0x10" edc:srcaddr="0x57fe" edc:srcmask="0x10"/>
      <edc:WORMHole edc:dstaddr="0xf8000a" edc:dstmask="0x20" edc:srcaddr="0x57fe" edc:srcmask="0x20"/>
      <edc:WORMHole edc:dstaddr="0xf8000a" edc:dstmask="0x40" edc:srcaddr="0x57fe" edc:srcmask="0x40"/>
      <edc:WORMHole edc:dstaddr="0xf8000a" edc:dstmask="0x80" edc:srcaddr="0x57fe" edc:srcmask="0x80"/>
      <edc:WORMHole edc:dstaddr="0xf8000c" edc:dstmask="0x10" edc:srcaddr="0x57fc" edc:srcmask="0x4"/>
      <edc:WORMHole edc:dstaddr="0xf8000c" edc:dstmask="0x20" edc:srcaddr="0x57fc" edc:srcmask="0x8"/>
      <edc:WORMHole edc:dstaddr="0xf8000c" edc:dstmask="0x40" edc:srcaddr="0x57fe" edc:srcmask="0x400"/>
      <edc:WORMHole edc:dstaddr="0xf8000c" edc:dstmask="0x80" edc:srcaddr="0x57fc" edc:srcmask="0x2000"/>
      <edc:WORMHole edc:dstaddr="0xf8000e" edc:dstmask="0x3" edc:srcaddr="0x57fe" edc:srcmask="0x300"/>
      <edc:WORMHole edc:dstaddr="0xf8000e" edc:dstmask="0x10" edc:srcaddr="0x57fe" edc:srcmask="0x8000"/>
      <edc:WORMHole edc:dstaddr="0xf8000e" edc:dstmask="0x20" edc:srcaddr="0x57fe" edc:srcmask="0x4000"/>
      <edc:WORMHole edc:dstaddr="0xf8000e" edc:dstmask="0x80" edc:srcaddr="0x57fe" edc:srcmask="0x800"/>
      <edc:DCRDef edc:access="nnnnnnnnnnnnnrnn" edc:cname="CONFIG2" edc:desc="" edc:factorydefault="0xffff" edc:impl="0xffff" edc:name="CONFIG2" edc:nzwidth="0x10" edc:unimplval="1" edc:unused="0x0" edc:useinchecksum="0xffff" edc:default="0xffff" edc:_addr="0x57FC">
        <edc:AliasList/>
        <edc:DCRModeList>
          <edc:DCRMode edc:id="DS.0">
            <edc:DCRFieldDef edc:cname="POSCMOD" edc:desc="Primary Oscillator Select" edc:mask="0x3" edc:name="POSCMOD" edc:nzwidth="0x2">
              <edc:DCRFieldSemantic edc:cname="NONE" edc:desc="Primary oscillator disabled" edc:when="(field &amp; 0x3) == 0x3"/>
              <edc:DCRFieldSemantic edc:cname="HS" edc:desc="HS Oscillator mode selected" edc:when="(field &amp; 0x3) == 0x2"/>
              <edc:DCRFieldSemantic edc:cname="MS" edc:desc="MS Oscillator mode selected" edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="EC" edc:desc="EC Oscillator mode selected" edc:when="(field &amp; 0x3) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="ALTI2C" edc:desc="Alternate I2C pins" edc:mask="0x1" edc:name="ALTI2C" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="I2C mapped to SDA1/SCL1" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="ON" edc:desc="I2C mapped to ASDA1/ASCL1" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="LPOL" edc:desc="Motor Control PWM Low Side Polarity bit" edc:ishidden="true" edc:islanghidden="true" edc:mask="0x1" edc:name="LPOL" edc:nzwidth="1">
              <edc:DCRFieldSemantic edc:cname="ON" edc:desc="PWM module low side output pins have active-high output polarity" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="PWM module low side output pins have active-low output polarity" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="IOL1WAY" edc:desc="IOLOCK Protection" edc:mask="0x1" edc:name="IOL1WAY" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="Allow Multiple Re-configurations" edc:when="(field &amp; 0x1) == 0x0"/>
              <edc:DCRFieldSemantic edc:cname="ON" edc:desc="Allow Only One Re-configuration" edc:when="(field &amp; 0x1) == 0x1"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="OSCIOFNC" edc:desc="Primary Oscillator Output Function" edc:mask="0x1" edc:name="OSCIOFNC" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="ON" edc:desc="OSC2 pin has digital I/O function" edc:when="(field &amp; 0x1) == 0x0"/>
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="OSC2 pin has clock out function" edc:when="(field &amp; 0x1) == 0x1"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="FCKSM" edc:desc="Clock Switching and Monitor" edc:mask="0x3" edc:name="FCKSM" edc:nzwidth="0x2">
              <edc:DCRFieldSemantic edc:cname="CSDCMD" edc:desc="Clock switching and Fail-Safe Clock Monitor are disabled" edc:when="(field &amp; 0x2) == 0x2"/>
              <edc:DCRFieldSemantic edc:cname="CSECMD" edc:desc="Clock switching is enabled, Fail-Safe Clock Monitor is disabled" edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="CSECME" edc:desc="Clock switching is enabled, Fail-Safe Clock Monitor is enabled" edc:when="(field &amp; 0x3) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="FNOSC" edc:desc="Oscillator Mode" edc:mask="0x7" edc:name="FNOSC" edc:nzwidth="3">
              <edc:DCRFieldSemantic edc:cname="FRC" edc:desc="Internal Fast RC (FRC)" edc:when="(field &amp; 0x7) == 0x0"/>
              <edc:DCRFieldSemantic edc:cname="FRCPLL" edc:desc="Internal Fast RC (FRC) w/ PLL" edc:when="(field &amp; 0x7) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="PRI" edc:desc="Primary Oscillator (MS, HS, EC)" edc:when="(field &amp; 0x7) == 0x2"/>
              <edc:DCRFieldSemantic edc:cname="PRIPLL" edc:desc="Primary Oscillator (MS, HS, EC) w/ PLL" edc:when="(field &amp; 0x7) == 0x3"/>
              <edc:DCRFieldSemantic edc:cname="SOSC" edc:desc="Secondary Oscillator (SOSC)" edc:when="(field &amp; 0x7) == 0x4"/>
              <edc:DCRFieldSemantic edc:cname="LPRC" edc:desc="Low Power RC Oscillator (LPRC)" edc:when="(field &amp; 0x7) == 0x5"/>
              <edc:DCRFieldSemantic edc:cname="FRCDIVN" edc:desc="Internal Fast RC (FRC) with divide by N" edc:when="(field &amp; 0x7) == 0x7"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="WDTWIN" edc:desc="Watchdog Window Select" edc:mask="0x3" edc:name="WDTWIN" edc:nzwidth="2">
              <edc:DCRFieldSemantic edc:cname="WDTWIN25" edc:desc="Watchdog Window is 25% of WDT period" edc:when="(field &amp; 0x3) == 0x3"/>
              <edc:DCRFieldSemantic edc:cname="WDTWIN37" edc:desc="Watchdog Window is 37.5% of WDT period" edc:when="(field &amp; 0x3) == 0x2"/>
              <edc:DCRFieldSemantic edc:cname="WDTWIN50" edc:desc="Watchdog Window is 50% of WDT period" edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="WDTWIN75" edc:desc="Watchdog Window is 75% of WDT period" edc:when="(field &amp; 0x3) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="PWMPIN" edc:desc="Motor Control PWM Module Pin Mode bit" edc:ishidden="true" edc:islanghidden="true" edc:mask="0x1" edc:name="PWMPIN" edc:nzwidth="1">
              <edc:DCRFieldSemantic edc:cname="ON" edc:desc="PWM module pins controlled by PORT register at device Reset" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="PWM module pins controlled by PWM module at device Reset" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="PWMLOCK" edc:desc="PWM Lock Enable" edc:ishidden="true" edc:islanghidden="true" edc:mask="0x1" edc:name="PWMLOCK" edc:nzwidth="1">
              <edc:DCRFieldSemantic edc:cname="ON" edc:desc="Certain PWM registers may only be written after key sequence" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="PWM registers may be written without key sequence" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="IESO" edc:desc="Internal External Switch Over Mode" edc:mask="0x1" edc:name="IESO" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="Start-up device with user-selected oscillator source" edc:when="(field &amp; 0x1) == 0x0"/>
              <edc:DCRFieldSemantic edc:cname="ON" edc:desc="Start-up device with FRC, then automatically switch to user-selected oscillator source when ready" edc:when="(field &amp; 0x1) == 0x1"/>
            </edc:DCRFieldDef>
          </edc:DCRMode>
        </edc:DCRModeList>
      </edc:DCRDef>
