xsession/openocd/tcl/packs/Microchip/dsPIC33F-GP-MC_DFP/1.4.235/edc/DSPIC33FJ32GP101.PIC
        <edc:JoinedSFRDef edc:cname="DOSTART" edc:desc="" edc:islanghidden="true" edc:name="DOSTART" edc:nzwidth="0x18" edc:_addr="0x3A">
          <edc:SFRModeList/>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="r" edc:stimtype="Address"/>
          <edc:SFRDef edc:access="nnnnnnnnnnnnnnnr" edc:cname="DOSTARTL" edc:desc="" edc:impl="0xffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuuuuuuuuu0" edc:name="DOSTARTL" edc:nzwidth="0x10" edc:por="xxxxxxxxxxxxxxx0" edc:_addr="0x3A">
            <edc:AliasList/>
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="DOSTARTL" edc:desc="" edc:islanghidden="true" edc:mask="0xffff" edc:name="DOSTARTL" edc:nzwidth="0x10"/>
              </edc:SFRMode>
            </edc:SFRModeList>
            <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="r" edc:stimtype="Record"/>
          </edc:SFRDef>
          <edc:SFRDef edc:access="----------nnnnnn" edc:cname="DOSTARTH" edc:desc="" edc:impl="0x3f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------uuuuuu" edc:name="DOSTARTH" edc:nzwidth="0x10" edc:por="----------xxxxxx" edc:_addr="0x3C">
            <edc:AliasList/>
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="DOSTARTH" edc:desc="" edc:islanghidden="true" edc:mask="0x3f" edc:name="DOSTARTH" edc:nzwidth="0x6"/>
              </edc:SFRMode>
            </edc:SFRModeList>
            <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="r" edc:stimtype="Record"/>
          </edc:SFRDef>
        </edc:JoinedSFRDef>
        <edc:JoinedSFRDef edc:cname="DOEND" edc:desc="" edc:islanghidden="true" edc:name="DOEND" edc:nzwidth="0x18" edc:_addr="0x3E">
          <edc:SFRModeList/>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="r" edc:stimtype="Address"/>
          <edc:SFRDef edc:access="nnnnnnnnnnnnnnnr" edc:cname="DOENDL" edc:desc="" edc:impl="0xffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuuuuuuuuu0" edc:name="DOENDL" edc:nzwidth="0x10" edc:por="xxxxxxxxxxxxxxx0" edc:_addr="0x3E">
            <edc:AliasList/>
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="DOENDL" edc:desc="" edc:islanghidden="true" edc:mask="0xffff" edc:name="DOENDL" edc:nzwidth="0x10"/>
              </edc:SFRMode>
            </edc:SFRModeList>
            <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="r" edc:stimtype="Record"/>
          </edc:SFRDef>
          <edc:SFRDef edc:access="----------nnnnnn" edc:cname="DOENDH" edc:desc="" edc:impl="0x3f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------uuuuuu" edc:name="DOENDH" edc:nzwidth="0x10" edc:por="----------xxxxxx" edc:_addr="0x40">
            <edc:AliasList/>
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="DOENDH" edc:desc="" edc:islanghidden="true" edc:mask="0x3f" edc:name="DOENDH" edc:nzwidth="0x6"/>
              </edc:SFRMode>
            </edc:SFRModeList>
            <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="r" edc:stimtype="Record"/>
          </edc:SFRDef>
        </edc:JoinedSFRDef>
        <edc:SFRDef edc:access="rrccrcrnnnnrnnnn" edc:cname="SR" edc:desc="" edc:impl="0xffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0000000000000000" edc:name="SR" edc:nzwidth="0x10" edc:por="0000000000000000" edc:_addr="0x42">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="C" edc:desc="" edc:mask="0x1" edc:name="C" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="Z" edc:desc="" edc:mask="0x1" edc:name="Z" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="OV" edc:desc="" edc:mask="0x1" edc:name="OV" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="N" edc:desc="" edc:mask="0x1" edc:name="N" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RA" edc:desc="" edc:mask="0x1" edc:name="RA" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="IPL" edc:desc="" edc:mask="0x7" edc:name="IPL" edc:nzwidth="0x3"/>
              <edc:SFRFieldDef edc:cname="DC" edc:desc="" edc:mask="0x1" edc:name="DC" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="DA" edc:desc="" edc:mask="0x1" edc:name="DA" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SAB" edc:desc="" edc:mask="0x1" edc:name="SAB" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="OAB" edc:desc="" edc:mask="0x1" edc:name="OAB" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SB" edc:desc="" edc:mask="0x1" edc:name="SB" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SA" edc:desc="" edc:mask="0x1" edc:name="SA" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="OB" edc:desc="" edc:mask="0x1" edc:name="OB" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="OA" edc:desc="" edc:mask="0x1" edc:name="OA" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:AdjustPoint edc:offset="5"/>
              <edc:SFRFieldDef edc:cname="IPL0" edc:desc="" edc:mask="0x1" edc:name="IPL0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="IPL1" edc:desc="" edc:mask="0x1" edc:name="IPL1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="IPL2" edc:desc="" edc:mask="0x1" edc:name="IPL2" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="r" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="---nwrrrnnnncnnn" edc:cname="CORCON" edc:desc="" edc:impl="0x1fff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---0000000100000" edc:name="CORCON" edc:nzwidth="0x10" edc:por="---0000000100000" edc:_addr="0x44">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="IF" edc:desc="" edc:mask="0x1" edc:name="IF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RND" edc:desc="" edc:mask="0x1" edc:name="RND" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PSV" edc:desc="" edc:mask="0x1" edc:name="PSV" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="IPL3" edc:desc="" edc:mask="0x1" edc:name="IPL3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ACCSAT" edc:desc="" edc:mask="0x1" edc:name="ACCSAT" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SATDW" edc:desc="" edc:mask="0x1" edc:name="SATDW" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SATB" edc:desc="" edc:mask="0x1" edc:name="SATB" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SATA" edc:desc="" edc:mask="0x1" edc:name="SATA" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="DL" edc:desc="" edc:mask="0x7" edc:name="DL" edc:nzwidth="0x3"/>
              <edc:SFRFieldDef edc:cname="EDT" edc:desc="" edc:mask="0x1" edc:name="EDT" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="US" edc:desc="" edc:mask="0x1" edc:name="US" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:AdjustPoint edc:offset="8"/>
              <edc:SFRFieldDef edc:cname="DL0" edc:desc="" edc:mask="0x1" edc:name="DL0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DL1" edc:desc="" edc:mask="0x1" edc:name="DL1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DL2" edc:desc="" edc:mask="0x1" edc:name="DL2" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="r" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nn--nnnnnnnnnnnn" edc:cname="MODCON" edc:desc="" edc:impl="0xcfff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00--000000000000" edc:name="MODCON" edc:nzwidth="0x10" edc:por="00--000000000000" edc:_addr="0x46">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="XWM" edc:desc="" edc:mask="0xf" edc:name="XWM" edc:nzwidth="0x4"/>
              <edc:SFRFieldDef edc:cname="YWM" edc:desc="" edc:mask="0xf" edc:name="YWM" edc:nzwidth="0x4"/>
              <edc:SFRFieldDef edc:cname="BWM" edc:desc="" edc:mask="0xf" edc:name="BWM" edc:nzwidth="0x4"/>
              <edc:AdjustPoint edc:offset="2"/>
              <edc:SFRFieldDef edc:cname="YMODEN" edc:desc="" edc:mask="0x1" edc:name="YMODEN" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="XMODEN" edc:desc="" edc:mask="0x1" edc:name="XMODEN" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="XWM0" edc:desc="" edc:mask="0x1" edc:name="XWM0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="XWM1" edc:desc="" edc:mask="0x1" edc:name="XWM1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="XWM2" edc:desc="" edc:mask="0x1" edc:name="XWM2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="XWM3" edc:desc="" edc:mask="0x1" edc:name="XWM3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="YWM0" edc:desc="" edc:mask="0x1" edc:name="YWM0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="YWM1" edc:desc="" edc:mask="0x1" edc:name="YWM1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="YWM2" edc:desc="" edc:mask="0x1" edc:name="YWM2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="YWM3" edc:desc="" edc:mask="0x1" edc:name="YWM3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="BWM0" edc:desc="" edc:mask="0x1" edc:name="BWM0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="BWM1" edc:desc="" edc:mask="0x1" edc:name="BWM1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="BWM2" edc:desc="" edc:mask="0x1" edc:name="BWM2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="BWM3" edc:desc="" edc:mask="0x1" edc:name="BWM3" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="r" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnnnnnnnnnr" edc:cname="XMODSRT" edc:desc="" edc:impl="0xffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuuuuuuuuu0" edc:name="XMODSRT" edc:nzwidth="0x10" edc:por="xxxxxxxxxxxxxxx0" edc:_addr="0x48">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="XS" edc:desc="" edc:islanghidden="true" edc:mask="0xffff" edc:name="XS" edc:nzwidth="0x10"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="r" edc:stimtype="Integer"/>
        </edc:SFRDef>
