xsession/openocd/tcl/packs/Microchip/dsPIC33F-GP-MC_DFP/1.4.235/edc/DSPIC33FJ32GP101.PIC
        <edc:SFRDef edc:access="---------nnnnnnn" edc:cname="CM1FLTR" edc:desc="" edc:impl="0x0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---------xxxxxxx" edc:name="CM1FLTR" edc:nzwidth="16" edc:por="---------xxxxxxx" edc:_modsrc="DOS-01080.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0xc" edc:_addr="0x65A">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="CFDIV" edc:desc="" edc:mask="0x7" edc:name="CFDIV" edc:nzwidth="3"/>
              <edc:SFRFieldDef edc:cname="CFLTREN" edc:desc="" edc:mask="0x1" edc:name="CFLTREN" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CFSEL" edc:desc="" edc:mask="0x7" edc:name="CFSEL" edc:nzwidth="3"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="CFDIV0" edc:desc="" edc:mask="0x1" edc:name="CFDIV0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CFDIV1" edc:desc="" edc:mask="0x1" edc:name="CFDIV1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CFDIV2" edc:desc="" edc:mask="0x1" edc:name="CFDIV2" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="CFSEL0" edc:desc="" edc:mask="0x1" edc:name="CFSEL0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CFSEL1" edc:desc="" edc:mask="0x1" edc:name="CFSEL1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CFSEL2" edc:desc="" edc:mask="0x1" edc:name="CFSEL2" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnn---nrnn-n--nn" edc:cname="CM2CON" edc:desc="" edc:impl="0xe3d3" edc:isindirect="false" edc:isvolatile="true" edc:mclr="000---0000-0--00" edc:name="CM2CON" edc:nzwidth="0x10" edc:por="000---0000-0--00" edc:_modsrc="DOS-01080.Module" edc:_refcount="2" edc:_begin="0x4" edc:_end="0xc" edc:_addr="0x65C">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="CCH" edc:desc="" edc:mask="0x3" edc:name="CCH" edc:nzwidth="2"/>
              <edc:AdjustPoint edc:offset="2"/>
              <edc:SFRFieldDef edc:cname="CREF" edc:desc="" edc:mask="0x1" edc:name="CREF" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="EVPOL" edc:desc="" edc:mask="0x3" edc:name="EVPOL" edc:nzwidth="2"/>
              <edc:SFRFieldDef edc:cname="COUT" edc:desc="" edc:mask="0x1" edc:name="COUT" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CEVT" edc:desc="" edc:mask="0x1" edc:name="CEVT" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="2"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="CPOL" edc:desc="" edc:mask="0x1" edc:name="CPOL" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="COE" edc:desc="" edc:mask="0x1" edc:name="COE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CON" edc:desc="" edc:mask="0x1" edc:name="CON" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="CCH0" edc:desc="" edc:mask="0x1" edc:name="CCH0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CCH1" edc:desc="" edc:mask="0x1" edc:name="CCH1" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="4"/>
              <edc:SFRFieldDef edc:cname="EVPOL0" edc:desc="" edc:mask="0x1" edc:name="EVPOL0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EVPOL1" edc:desc="" edc:mask="0x1" edc:name="EVPOL1" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="7"/>
              <edc:SFRFieldDef edc:cname="CEN" edc:desc="" edc:mask="0x1" edc:name="CEN" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="----nnnnnnnnnnnn" edc:cname="CM2MSKSRC" edc:desc="" edc:impl="0x0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----xxxxxxxxxxxx" edc:name="CM2MSKSRC" edc:nzwidth="16" edc:por="----xxxxxxxxxxxx" edc:_modsrc="DOS-01080.Module" edc:_refcount="2" edc:_begin="0x4" edc:_end="0xc" edc:_addr="0x65E">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="SELSRCA" edc:desc="" edc:mask="0xf" edc:name="SELSRCA" edc:nzwidth="4"/>
              <edc:SFRFieldDef edc:cname="SELSRCB" edc:desc="" edc:mask="0xf" edc:name="SELSRCB" edc:nzwidth="4"/>
              <edc:SFRFieldDef edc:cname="SELSRCC" edc:desc="" edc:mask="0xf" edc:name="SELSRCC" edc:nzwidth="4"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="SELSRCA0" edc:desc="" edc:mask="0x1" edc:name="SELSRCA0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SELSRCA1" edc:desc="" edc:mask="0x1" edc:name="SELSRCA1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SELSRCA2" edc:desc="" edc:mask="0x1" edc:name="SELSRCA2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SELSRCA3" edc:desc="" edc:mask="0x1" edc:name="SELSRCA3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SELSRCB0" edc:desc="" edc:mask="0x1" edc:name="SELSRCB0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SELSRCB1" edc:desc="" edc:mask="0x1" edc:name="SELSRCB1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SELSRCB2" edc:desc="" edc:mask="0x1" edc:name="SELSRCB2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SELSRCB3" edc:desc="" edc:mask="0x1" edc:name="SELSRCB3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SELSRCC0" edc:desc="" edc:mask="0x1" edc:name="SELSRCC0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SELSRCC1" edc:desc="" edc:mask="0x1" edc:name="SELSRCC1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SELSRCC2" edc:desc="" edc:mask="0x1" edc:name="SELSRCC2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SELSRCC3" edc:desc="" edc:mask="0x1" edc:name="SELSRCC3" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="n-nnnnnnnnnnnnnn" edc:cname="CM2MSKCON" edc:desc="" edc:impl="0x0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="x-xxxxxxxxxxxxxx" edc:name="CM2MSKCON" edc:nzwidth="16" edc:por="x-xxxxxxxxxxxxxx" edc:_modsrc="DOS-01080.Module" edc:_refcount="2" edc:_begin="0x4" edc:_end="0xc" edc:_addr="0x660">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="AANEN" edc:desc="" edc:mask="0x1" edc:name="AANEN" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="AAEN" edc:desc="" edc:mask="0x1" edc:name="AAEN" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ABNEN" edc:desc="" edc:mask="0x1" edc:name="ABNEN" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ABEN" edc:desc="" edc:mask="0x1" edc:name="ABEN" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ACNEN" edc:desc="" edc:mask="0x1" edc:name="ACNEN" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ACEN" edc:desc="" edc:mask="0x1" edc:name="ACEN" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PAGS" edc:desc="" edc:mask="0x1" edc:name="PAGS" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="NAGS" edc:desc="" edc:mask="0x1" edc:name="NAGS" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="OANEN" edc:desc="" edc:mask="0x1" edc:name="OANEN" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="OAEN" edc:desc="" edc:mask="0x1" edc:name="OAEN" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="OBNEN" edc:desc="" edc:mask="0x1" edc:name="OBNEN" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="OBEN" edc:desc="" edc:mask="0x1" edc:name="OBEN" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="OCNEN" edc:desc="" edc:mask="0x1" edc:name="OCNEN" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="OCEN" edc:desc="" edc:mask="0x1" edc:name="OCEN" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="HLMS" edc:desc="" edc:mask="0x1" edc:name="HLMS" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="---------nnnnnnn" edc:cname="CM2FLTR" edc:desc="" edc:impl="0x0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---------xxxxxxx" edc:name="CM2FLTR" edc:nzwidth="16" edc:por="---------xxxxxxx" edc:_modsrc="DOS-01080.Module" edc:_refcount="2" edc:_begin="0x4" edc:_end="0xc" edc:_addr="0x662">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="CFDIV" edc:desc="" edc:mask="0x7" edc:name="CFDIV" edc:nzwidth="3"/>
              <edc:SFRFieldDef edc:cname="CFLTREN" edc:desc="" edc:mask="0x1" edc:name="CFLTREN" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CFSEL" edc:desc="" edc:mask="0x7" edc:name="CFSEL" edc:nzwidth="3"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="CFDIV0" edc:desc="" edc:mask="0x1" edc:name="CFDIV0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CFDIV1" edc:desc="" edc:mask="0x1" edc:name="CFDIV1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CFDIV2" edc:desc="" edc:mask="0x1" edc:name="CFDIV2" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="CFSEL0" edc:desc="" edc:mask="0x1" edc:name="CFSEL0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CFSEL1" edc:desc="" edc:mask="0x1" edc:name="CFSEL1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CFSEL2" edc:desc="" edc:mask="0x1" edc:name="CFSEL2" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnn---nrnn-n--nn" edc:cname="CM3CON" edc:desc="" edc:impl="0xe3d3" edc:isindirect="false" edc:isvolatile="true" edc:mclr="000---0000-0--00" edc:name="CM3CON" edc:nzwidth="0x10" edc:por="000---0000-0--00" edc:_modsrc="DOS-01080.Module" edc:_refcount="3" edc:_begin="0x4" edc:_end="0xc" edc:_addr="0x664">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="CCH" edc:desc="" edc:mask="0x3" edc:name="CCH" edc:nzwidth="2"/>
              <edc:AdjustPoint edc:offset="2"/>
              <edc:SFRFieldDef edc:cname="CREF" edc:desc="" edc:mask="0x1" edc:name="CREF" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="EVPOL" edc:desc="" edc:mask="0x3" edc:name="EVPOL" edc:nzwidth="2"/>
              <edc:SFRFieldDef edc:cname="COUT" edc:desc="" edc:mask="0x1" edc:name="COUT" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CEVT" edc:desc="" edc:mask="0x1" edc:name="CEVT" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="2"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="CPOL" edc:desc="" edc:mask="0x1" edc:name="CPOL" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="COE" edc:desc="" edc:mask="0x1" edc:name="COE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CON" edc:desc="" edc:mask="0x1" edc:name="CON" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="CCH0" edc:desc="" edc:mask="0x1" edc:name="CCH0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CCH1" edc:desc="" edc:mask="0x1" edc:name="CCH1" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="4"/>
              <edc:SFRFieldDef edc:cname="EVPOL0" edc:desc="" edc:mask="0x1" edc:name="EVPOL0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EVPOL1" edc:desc="" edc:mask="0x1" edc:name="EVPOL1" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="7"/>
              <edc:SFRFieldDef edc:cname="CEN" edc:desc="" edc:mask="0x1" edc:name="CEN" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="----nnnnnnnnnnnn" edc:cname="CM3MSKSRC" edc:desc="" edc:impl="0x0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----xxxxxxxxxxxx" edc:name="CM3MSKSRC" edc:nzwidth="16" edc:por="----xxxxxxxxxxxx" edc:_modsrc="DOS-01080.Module" edc:_refcount="3" edc:_begin="0x4" edc:_end="0xc" edc:_addr="0x666">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="SELSRCA" edc:desc="" edc:mask="0xf" edc:name="SELSRCA" edc:nzwidth="4"/>
              <edc:SFRFieldDef edc:cname="SELSRCB" edc:desc="" edc:mask="0xf" edc:name="SELSRCB" edc:nzwidth="4"/>
              <edc:SFRFieldDef edc:cname="SELSRCC" edc:desc="" edc:mask="0xf" edc:name="SELSRCC" edc:nzwidth="4"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="SELSRCA0" edc:desc="" edc:mask="0x1" edc:name="SELSRCA0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SELSRCA1" edc:desc="" edc:mask="0x1" edc:name="SELSRCA1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SELSRCA2" edc:desc="" edc:mask="0x1" edc:name="SELSRCA2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SELSRCA3" edc:desc="" edc:mask="0x1" edc:name="SELSRCA3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SELSRCB0" edc:desc="" edc:mask="0x1" edc:name="SELSRCB0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SELSRCB1" edc:desc="" edc:mask="0x1" edc:name="SELSRCB1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SELSRCB2" edc:desc="" edc:mask="0x1" edc:name="SELSRCB2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SELSRCB3" edc:desc="" edc:mask="0x1" edc:name="SELSRCB3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SELSRCC0" edc:desc="" edc:mask="0x1" edc:name="SELSRCC0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SELSRCC1" edc:desc="" edc:mask="0x1" edc:name="SELSRCC1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SELSRCC2" edc:desc="" edc:mask="0x1" edc:name="SELSRCC2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SELSRCC3" edc:desc="" edc:mask="0x1" edc:name="SELSRCC3" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
